[
    {
        "id": 0,
        "title": "Machine Learning Basics",
        "content": "Machine Learning Overview:\n1. Definition: Machine learning is a subset of AI that enables systems to learn and improve from experience.\n\nKey Types of Machine Learning:\n- Supervised Learning: Model learns from labeled training data\n  * Examples: Classification, Regression\n- Unsupervised Learning: Model finds patterns in unlabeled data\n  * Examples: Clustering, Dimensionality Reduction\n- Reinforcement Learning: Agent learns by interacting with environment\n\nCommon Algorithms:\n* Linear Regression\n* Decision Trees\n* Neural Networks\n* Support Vector Machines\n* K-Means Clustering",
        "created": 1742410253.408897,
        "last_edited": 1742669453.408912
    },
    {
        "id": 1,
        "title": "Python Programming Cheatsheet",
        "content": "Python Essentials:\n1. Data Types\n- Integers: whole numbers (int)\n- Floats: decimal numbers (float)\n- Strings: text data (str)\n- Lists: ordered, mutable collections []\n- Dictionaries: key-value pairs {}\n\n2. Basic Operations\n* Arithmetic: +, -, *, /, //, %\n* Comparison: ==, !=, <, >, <=, >=\n* Logical: and, or, not\n\n3. Control Flow\n- if-elif-else statements\n- for loops\n- while loops\n- list comprehensions\n\n4. Functions\ndef function_name(parameters):\n    # function body\n    return value",
        "created": 1741978253.408917,
        "last_edited": 1742583053.40892
    },
    {
        "id": 2,
        "title": "money",
        "content": "The invention of money was prehistoric.[1][2] Consequently, any story of how money first developed is mostly based on conjecture and logical inference.\n\nA significant amount of evidence establishes that many things were traded in ancient markets that could be described as a medium of exchange. These included livestock and grain – things directly useful in themselves – but also merely attractive items such as cowrie shells or beads[3] which were exchanged for more useful commodities.\n\nDue to the complexities of ancient history (ancient civilizations developing at different paces and not keeping accurate records, or having their records destroyed), and because the ancient origins of economic systems precede written history, it has not been possible to trace the true origin of the invention of money. Further, historical evidence[4] supports the idea that money has taken two main forms, divided into the broad categories of money of account (debits and credits on ledgers) and money of exchange (tangible media of exchange made from clay, leather, paper, bamboo, metal, etc.).\n\nAs \"money of account\" depends on the ability to record a count, the tally stick was a significant development. The oldest of these dates from the Aurignacian, about 30,000 years ago.[5][6] The 20,000-year-old Ishango bone – found near one of the sources of the Nile in the Democratic Republic of the Congo – seems to use matched tally marks on the thigh bone of a baboon for correspondence counting. Accounting records – in the monetary system sense of the term accounting – dating back more than 7,000 years have been found in Mesopotamia,[7] and documents from ancient Mesopotamia show lists of expenditures, and goods received and traded and the history of accounting evidences that money of account pre-dates the use of coinage by several thousand years. David Graeber proposes that money as a unit of account was invented when the unquantifiable obligation \"I owe you one\" transformed into the quantifiable notion of \"I owe you one unit of something\". In this view, money emerged first as money of account and only later took the form of money of exchange.[8][9]\n\nRegarding money of exchange, the use of representative money historically pre-dates the invention of coinage as well.[1] In the ancient empires of Egypt, Babylon, India and China, the temples and palaces often had commodity warehouses which made use of clay tokens[1] and other materials which served as evidence of a claim upon a portion of the goods stored in the warehouses.[10] There is no concrete evidence these kinds of tokens were used for trade, however, only for administration and accounting.[1]",
        "created": 1742842357.031643,
        "last_edited": 1742842381.161236
    }
]